7767517
182 200
Input            data                     0 1 data
MemoryData       339                      0 1 339 0=1 1=1 2=3
MemoryData       341                      0 1 341 0=1 1=1 2=3
BinaryOp         Div_1                    1 1 data 338 0=3 1=1 2=2.550000e+02
BinaryOp         Sub_3                    2 1 338 339 340 0=1
BinaryOp         Div_5                    2 1 340 341 342 0=3
Reshape          Reshape_7                1 1 342 344 0=128 1=128 2=3
Convolution      Conv_8                   1 1 344 345 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Mul_17                   1 1 345 354 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 354 354_splitncnn_0 354_splitncnn_1
ConvolutionDepthWise Conv_18                  1 1 354_splitncnn_1 355 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_20                  1 1 355 357
Convolution      Conv_21                  1 1 357 358 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
BinaryOp         Add_23                   2 1 354_splitncnn_0 358 360 0=0
Convolution      Conv_24                  1 1 360 361 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_26                  1 1 361 363
ConvolutionDepthWise Conv_27                  1 1 363 364 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_29                  1 1 364 366
Convolution      Conv_30                  1 1 366 367 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Split            splitncnn_1              1 2 367 367_splitncnn_0 367_splitncnn_1
Convolution      Conv_32                  1 1 367_splitncnn_1 369 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_34                  1 1 369 371
ConvolutionDepthWise Conv_35                  1 1 371 372 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_37                  1 1 372 374
Convolution      Conv_38                  1 1 374 375 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
BinaryOp         Add_40                   2 1 367_splitncnn_0 375 377 0=0
Convolution      Conv_41                  1 1 377 378 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_43                  1 1 378 380
ConvolutionDepthWise Conv_44                  1 1 380 381 0=72 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
Split            splitncnn_2              1 2 381 381_splitncnn_0 381_splitncnn_1
Pooling          GlobalAveragePool_52     1 1 381_splitncnn_1 389 0=1 4=1
Reshape          Reshape_56               1 1 389 393 0=72
InnerProduct     Gemm_57                  1 1 393 394 0=24 1=1 2=1728
ReLU             Relu_58                  1 1 394 395
InnerProduct     Gemm_59                  1 1 395 396 0=72 1=1 2=1728
HardSigmoid      Div_66                   1 1 396 403 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_70               1 1 403 411 0=1 1=1 2=72
BinaryOp         Mul_71                   2 1 381_splitncnn_0 411 412 0=2
ReLU             Relu_72                  1 1 412 413
Convolution      Conv_73                  1 1 413 414 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2880
Split            splitncnn_3              1 2 414 414_splitncnn_0 414_splitncnn_1
Convolution      Conv_75                  1 1 414_splitncnn_1 416 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_77                  1 1 416 418
ConvolutionDepthWise Conv_78                  1 1 418 419 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_4              1 2 419 419_splitncnn_0 419_splitncnn_1
Pooling          GlobalAveragePool_86     1 1 419_splitncnn_1 427 0=1 4=1
Reshape          Reshape_90               1 1 427 431 0=120
InnerProduct     Gemm_91                  1 1 431 432 0=32 1=1 2=3840
ReLU             Relu_92                  1 1 432 433
InnerProduct     Gemm_93                  1 1 433 434 0=120 1=1 2=3840
HardSigmoid      Div_100                  1 1 434 441 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_104              1 1 441 449 0=1 1=1 2=120
BinaryOp         Mul_105                  2 1 419_splitncnn_0 449 450 0=2
ReLU             Relu_106                 1 1 450 451
Convolution      Conv_107                 1 1 451 452 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_109                  2 1 414_splitncnn_0 452 454 0=0
Split            splitncnn_5              1 2 454 454_splitncnn_0 454_splitncnn_1
Convolution      Conv_110                 1 1 454_splitncnn_1 455 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_112                 1 1 455 457
ConvolutionDepthWise Conv_113                 1 1 457 458 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_6              1 2 458 458_splitncnn_0 458_splitncnn_1
Pooling          GlobalAveragePool_121    1 1 458_splitncnn_1 466 0=1 4=1
Reshape          Reshape_125              1 1 466 470 0=120
InnerProduct     Gemm_126                 1 1 470 471 0=32 1=1 2=3840
ReLU             Relu_127                 1 1 471 472
InnerProduct     Gemm_128                 1 1 472 473 0=120 1=1 2=3840
HardSigmoid      Div_135                  1 1 473 480 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_139              1 1 480 488 0=1 1=1 2=120
BinaryOp         Mul_140                  2 1 458_splitncnn_0 488 489 0=2
ReLU             Relu_141                 1 1 489 490
Convolution      Conv_142                 1 1 490 491 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_144                  2 1 454_splitncnn_0 491 493 0=0
Convolution      Conv_145                 1 1 493 494 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Mul_154                  1 1 494 503 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_155                 1 1 503 504 0=240 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2160 7=240
HardSwish        Mul_164                  1 1 504 513 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_165                 1 1 513 514 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19200
Split            splitncnn_7              1 2 514 514_splitncnn_0 514_splitncnn_1
Convolution      Conv_167                 1 1 514_splitncnn_1 516 0=200 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
HardSwish        Mul_176                  1 1 516 525 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_177                 1 1 525 526 0=200 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1800 7=200
HardSwish        Mul_186                  1 1 526 535 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_187                 1 1 535 536 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
BinaryOp         Add_189                  2 1 514_splitncnn_0 536 538 0=0
Split            splitncnn_8              1 2 538 538_splitncnn_0 538_splitncnn_1
Convolution      Conv_190                 1 1 538_splitncnn_1 539 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_199                  1 1 539 548 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_200                 1 1 548 549 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_209                  1 1 549 558 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_210                 1 1 558 559 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_212                  2 1 538_splitncnn_0 559 561 0=0
Split            splitncnn_9              1 2 561 561_splitncnn_0 561_splitncnn_1
Convolution      Conv_213                 1 1 561_splitncnn_1 562 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_222                  1 1 562 571 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_223                 1 1 571 572 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_232                  1 1 572 581 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_233                 1 1 581 582 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_235                  2 1 561_splitncnn_0 582 584 0=0
Convolution      Conv_236                 1 1 584 585 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        Mul_245                  1 1 585 594 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_246                 1 1 594 595 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
Split            splitncnn_10             1 2 595 595_splitncnn_0 595_splitncnn_1
Pooling          GlobalAveragePool_254    1 1 595_splitncnn_1 603 0=1 4=1
Reshape          Reshape_258              1 1 603 607 0=480
InnerProduct     Gemm_259                 1 1 607 608 0=120 1=1 2=57600
ReLU             Relu_260                 1 1 608 609
InnerProduct     Gemm_261                 1 1 609 610 0=480 1=1 2=57600
HardSigmoid      Div_268                  1 1 610 617 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_272              1 1 617 625 0=1 1=1 2=480
BinaryOp         Mul_273                  2 1 595_splitncnn_0 625 626 0=2
HardSwish        Mul_281                  1 1 626 634 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_282                 1 1 634 635 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53760
Split            splitncnn_11             1 2 635 635_splitncnn_0 635_splitncnn_1
Convolution      Conv_284                 1 1 635_splitncnn_1 637 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_293                  1 1 637 646 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_294                 1 1 646 647 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6048 7=672
Split            splitncnn_12             1 2 647 647_splitncnn_0 647_splitncnn_1
Pooling          GlobalAveragePool_302    1 1 647_splitncnn_1 655 0=1 4=1
Reshape          Reshape_306              1 1 655 659 0=672
InnerProduct     Gemm_307                 1 1 659 660 0=168 1=1 2=112896
ReLU             Relu_308                 1 1 660 661
InnerProduct     Gemm_309                 1 1 661 662 0=672 1=1 2=112896
HardSigmoid      Div_316                  1 1 662 669 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_320              1 1 669 677 0=1 1=1 2=672
BinaryOp         Mul_321                  2 1 647_splitncnn_0 677 678 0=2
HardSwish        Mul_329                  1 1 678 686 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_330                 1 1 686 687 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
BinaryOp         Add_332                  2 1 635_splitncnn_0 687 689 0=0
Convolution      Conv_333                 1 1 689 690 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_342                  1 1 690 699 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_343                 1 1 699 700 0=672 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=16800 7=672
Split            splitncnn_13             1 2 700 700_splitncnn_0 700_splitncnn_1
Pooling          GlobalAveragePool_351    1 1 700_splitncnn_1 708 0=1 4=1
Reshape          Reshape_355              1 1 708 712 0=672
InnerProduct     Gemm_356                 1 1 712 713 0=168 1=1 2=112896
ReLU             Relu_357                 1 1 713 714
InnerProduct     Gemm_358                 1 1 714 715 0=672 1=1 2=112896
HardSigmoid      Div_365                  1 1 715 722 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_369              1 1 722 730 0=1 1=1 2=672
BinaryOp         Mul_370                  2 1 700_splitncnn_0 730 731 0=2
HardSwish        Mul_378                  1 1 731 739 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_379                 1 1 739 740 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=107520
Split            splitncnn_14             1 2 740 740_splitncnn_0 740_splitncnn_1
Convolution      Conv_381                 1 1 740_splitncnn_1 742 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_390                  1 1 742 751 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_391                 1 1 751 752 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_15             1 2 752 752_splitncnn_0 752_splitncnn_1
Pooling          GlobalAveragePool_399    1 1 752_splitncnn_1 760 0=1 4=1
Reshape          Reshape_403              1 1 760 764 0=960
InnerProduct     Gemm_404                 1 1 764 765 0=240 1=1 2=230400
ReLU             Relu_405                 1 1 765 766
InnerProduct     Gemm_406                 1 1 766 767 0=960 1=1 2=230400
HardSigmoid      Div_413                  1 1 767 774 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_417              1 1 774 782 0=1 1=1 2=960
BinaryOp         Mul_418                  2 1 752_splitncnn_0 782 783 0=2
HardSwish        Mul_426                  1 1 783 791 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_427                 1 1 791 792 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_429                  2 1 740_splitncnn_0 792 794 0=0
Split            splitncnn_16             1 2 794 794_splitncnn_0 794_splitncnn_1
Convolution      Conv_430                 1 1 794_splitncnn_1 795 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_439                  1 1 795 804 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_440                 1 1 804 805 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_17             1 2 805 805_splitncnn_0 805_splitncnn_1
Pooling          GlobalAveragePool_448    1 1 805_splitncnn_1 813 0=1 4=1
Reshape          Reshape_452              1 1 813 817 0=960
InnerProduct     Gemm_453                 1 1 817 818 0=240 1=1 2=230400
ReLU             Relu_454                 1 1 818 819
InnerProduct     Gemm_455                 1 1 819 820 0=960 1=1 2=230400
HardSigmoid      Div_462                  1 1 820 827 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_466              1 1 827 835 0=1 1=1 2=960
BinaryOp         Mul_467                  2 1 805_splitncnn_0 835 836 0=2
HardSwish        Mul_475                  1 1 836 844 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_476                 1 1 844 845 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_478                  2 1 794_splitncnn_0 845 847 0=0
Convolution      Conv_479                 1 1 847 848 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=204800
HardSwish        Mul_488                  1 1 848 857 0=1.666667e-01 1=5.000000e-01
Pooling          GlobalAveragePool_489    1 1 857 858 0=1 4=1
Reshape          Reshape_495              1 1 858 866 0=-1
BatchNorm        BatchNormalization_496   1 1 866 867 0=1280
HardSwish        Mul_504                  1 1 867 875 0=1.666667e-01 1=5.000000e-01
InnerProduct     Gemm_505                 1 1 875 876 0=2 1=1 2=2560
Softmax          Softmax_508              1 1 876 softmax 0=0 1=1
