7767517
178 196
Input            data                     0 1 data
Reshape          Reshape_1                1 1 data 338 0=128 1=128 2=3
Convolution      Conv_2                   1 1 338 845 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Mul_7                    1 1 845 347 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 347 347_splitncnn_0 347_splitncnn_1
ConvolutionDepthWise Conv_8                   1 1 347_splitncnn_1 848 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_9                   1 1 848 350
Convolution      Conv_10                  1 1 350 851 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
BinaryOp         Add_11                   2 1 347_splitncnn_0 851 353 0=0
Convolution      Conv_12                  1 1 353 854 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_13                  1 1 854 356
ConvolutionDepthWise Conv_14                  1 1 356 857 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_15                  1 1 857 359
Convolution      Conv_16                  1 1 359 860 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Split            splitncnn_1              1 2 860 860_splitncnn_0 860_splitncnn_1
Convolution      Conv_17                  1 1 860_splitncnn_1 863 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_18                  1 1 863 364
ConvolutionDepthWise Conv_19                  1 1 364 866 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_20                  1 1 866 367
Convolution      Conv_21                  1 1 367 869 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
BinaryOp         Add_22                   2 1 860_splitncnn_0 869 370 0=0
Convolution      Conv_23                  1 1 370 872 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_24                  1 1 872 373
ConvolutionDepthWise Conv_25                  1 1 373 875 0=72 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
Split            splitncnn_2              1 2 875 875_splitncnn_0 875_splitncnn_1
Pooling          GlobalAveragePool_32     1 1 875_splitncnn_1 382 0=1 4=1
Reshape          Reshape_36               1 1 382 386 0=72
InnerProduct     Gemm_37                  1 1 386 387 0=24 1=1 2=1728
ReLU             Relu_38                  1 1 387 388
InnerProduct     Gemm_39                  1 1 388 389 0=72 1=1 2=1728
HardSigmoid      Div_43                   1 1 389 395 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_47               1 1 395 403 0=1 1=1 2=72
BinaryOp         Mul_48                   2 1 875_splitncnn_0 403 404 0=2
ReLU             Relu_49                  1 1 404 405
Convolution      Conv_50                  1 1 405 878 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2880
Split            splitncnn_3              1 2 878 878_splitncnn_0 878_splitncnn_1
Convolution      Conv_51                  1 1 878_splitncnn_1 881 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_52                  1 1 881 410
ConvolutionDepthWise Conv_53                  1 1 410 884 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_4              1 2 884 884_splitncnn_0 884_splitncnn_1
Pooling          GlobalAveragePool_60     1 1 884_splitncnn_1 419 0=1 4=1
Reshape          Reshape_64               1 1 419 423 0=120
InnerProduct     Gemm_65                  1 1 423 424 0=32 1=1 2=3840
ReLU             Relu_66                  1 1 424 425
InnerProduct     Gemm_67                  1 1 425 426 0=120 1=1 2=3840
HardSigmoid      Div_71                   1 1 426 432 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_75               1 1 432 440 0=1 1=1 2=120
BinaryOp         Mul_76                   2 1 884_splitncnn_0 440 441 0=2
ReLU             Relu_77                  1 1 441 442
Convolution      Conv_78                  1 1 442 887 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_79                   2 1 878_splitncnn_0 887 445 0=0
Split            splitncnn_5              1 2 445 445_splitncnn_0 445_splitncnn_1
Convolution      Conv_80                  1 1 445_splitncnn_1 890 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_81                  1 1 890 448
ConvolutionDepthWise Conv_82                  1 1 448 893 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_6              1 2 893 893_splitncnn_0 893_splitncnn_1
Pooling          GlobalAveragePool_89     1 1 893_splitncnn_1 457 0=1 4=1
Reshape          Reshape_93               1 1 457 461 0=120
InnerProduct     Gemm_94                  1 1 461 462 0=32 1=1 2=3840
ReLU             Relu_95                  1 1 462 463
InnerProduct     Gemm_96                  1 1 463 464 0=120 1=1 2=3840
HardSigmoid      Div_100                  1 1 464 470 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_104              1 1 470 478 0=1 1=1 2=120
BinaryOp         Mul_105                  2 1 893_splitncnn_0 478 479 0=2
ReLU             Relu_106                 1 1 479 480
Convolution      Conv_107                 1 1 480 896 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_108                  2 1 445_splitncnn_0 896 483 0=0
Convolution      Conv_109                 1 1 483 899 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Mul_114                  1 1 899 492 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_115                 1 1 492 902 0=240 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2160 7=240
HardSwish        Mul_120                  1 1 902 501 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_121                 1 1 501 905 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19200
Split            splitncnn_7              1 2 905 905_splitncnn_0 905_splitncnn_1
Convolution      Conv_122                 1 1 905_splitncnn_1 908 0=200 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
HardSwish        Mul_127                  1 1 908 512 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_128                 1 1 512 911 0=200 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1800 7=200
HardSwish        Mul_133                  1 1 911 521 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_134                 1 1 521 914 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
BinaryOp         Add_135                  2 1 905_splitncnn_0 914 524 0=0
Split            splitncnn_8              1 2 524 524_splitncnn_0 524_splitncnn_1
Convolution      Conv_136                 1 1 524_splitncnn_1 917 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_141                  1 1 917 533 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_142                 1 1 533 920 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_147                  1 1 920 542 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_148                 1 1 542 923 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_149                  2 1 524_splitncnn_0 923 545 0=0
Split            splitncnn_9              1 2 545 545_splitncnn_0 545_splitncnn_1
Convolution      Conv_150                 1 1 545_splitncnn_1 926 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_155                  1 1 926 554 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_156                 1 1 554 929 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_161                  1 1 929 563 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_162                 1 1 563 932 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_163                  2 1 545_splitncnn_0 932 566 0=0
Convolution      Conv_164                 1 1 566 935 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        Mul_169                  1 1 935 575 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_170                 1 1 575 938 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
Split            splitncnn_10             1 2 938 938_splitncnn_0 938_splitncnn_1
Pooling          GlobalAveragePool_177    1 1 938_splitncnn_1 584 0=1 4=1
Reshape          Reshape_181              1 1 584 588 0=480
InnerProduct     Gemm_182                 1 1 588 589 0=120 1=1 2=57600
ReLU             Relu_183                 1 1 589 590
InnerProduct     Gemm_184                 1 1 590 591 0=480 1=1 2=57600
HardSigmoid      Div_188                  1 1 591 597 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_192              1 1 597 605 0=1 1=1 2=480
BinaryOp         Mul_193                  2 1 938_splitncnn_0 605 606 0=2
HardSwish        Mul_198                  1 1 606 613 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_199                 1 1 613 941 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53760
Split            splitncnn_11             1 2 941 941_splitncnn_0 941_splitncnn_1
Convolution      Conv_200                 1 1 941_splitncnn_1 944 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_205                  1 1 944 624 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_206                 1 1 624 947 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6048 7=672
Split            splitncnn_12             1 2 947 947_splitncnn_0 947_splitncnn_1
Pooling          GlobalAveragePool_213    1 1 947_splitncnn_1 633 0=1 4=1
Reshape          Reshape_217              1 1 633 637 0=672
InnerProduct     Gemm_218                 1 1 637 638 0=168 1=1 2=112896
ReLU             Relu_219                 1 1 638 639
InnerProduct     Gemm_220                 1 1 639 640 0=672 1=1 2=112896
HardSigmoid      Div_224                  1 1 640 646 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_228              1 1 646 654 0=1 1=1 2=672
BinaryOp         Mul_229                  2 1 947_splitncnn_0 654 655 0=2
HardSwish        Mul_234                  1 1 655 662 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_235                 1 1 662 950 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
BinaryOp         Add_236                  2 1 941_splitncnn_0 950 665 0=0
Convolution      Conv_237                 1 1 665 953 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_242                  1 1 953 674 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_243                 1 1 674 956 0=672 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=16800 7=672
Split            splitncnn_13             1 2 956 956_splitncnn_0 956_splitncnn_1
Pooling          GlobalAveragePool_250    1 1 956_splitncnn_1 683 0=1 4=1
Reshape          Reshape_254              1 1 683 687 0=672
InnerProduct     Gemm_255                 1 1 687 688 0=168 1=1 2=112896
ReLU             Relu_256                 1 1 688 689
InnerProduct     Gemm_257                 1 1 689 690 0=672 1=1 2=112896
HardSigmoid      Div_261                  1 1 690 696 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_265              1 1 696 704 0=1 1=1 2=672
BinaryOp         Mul_266                  2 1 956_splitncnn_0 704 705 0=2
HardSwish        Mul_271                  1 1 705 712 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_272                 1 1 712 959 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=107520
Split            splitncnn_14             1 2 959 959_splitncnn_0 959_splitncnn_1
Convolution      Conv_273                 1 1 959_splitncnn_1 962 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_278                  1 1 962 723 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_279                 1 1 723 965 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_15             1 2 965 965_splitncnn_0 965_splitncnn_1
Pooling          GlobalAveragePool_286    1 1 965_splitncnn_1 732 0=1 4=1
Reshape          Reshape_290              1 1 732 736 0=960
InnerProduct     Gemm_291                 1 1 736 737 0=240 1=1 2=230400
ReLU             Relu_292                 1 1 737 738
InnerProduct     Gemm_293                 1 1 738 739 0=960 1=1 2=230400
HardSigmoid      Div_297                  1 1 739 745 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_301              1 1 745 753 0=1 1=1 2=960
BinaryOp         Mul_302                  2 1 965_splitncnn_0 753 754 0=2
HardSwish        Mul_307                  1 1 754 761 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_308                 1 1 761 968 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_309                  2 1 959_splitncnn_0 968 764 0=0
Split            splitncnn_16             1 2 764 764_splitncnn_0 764_splitncnn_1
Convolution      Conv_310                 1 1 764_splitncnn_1 971 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_315                  1 1 971 773 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_316                 1 1 773 974 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_17             1 2 974 974_splitncnn_0 974_splitncnn_1
Pooling          GlobalAveragePool_323    1 1 974_splitncnn_1 782 0=1 4=1
Reshape          Reshape_327              1 1 782 786 0=960
InnerProduct     Gemm_328                 1 1 786 787 0=240 1=1 2=230400
ReLU             Relu_329                 1 1 787 788
InnerProduct     Gemm_330                 1 1 788 789 0=960 1=1 2=230400
HardSigmoid      Div_334                  1 1 789 795 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_338              1 1 795 803 0=1 1=1 2=960
BinaryOp         Mul_339                  2 1 974_splitncnn_0 803 804 0=2
HardSwish        Mul_344                  1 1 804 811 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_345                 1 1 811 977 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_346                  2 1 764_splitncnn_0 977 814 0=0
Convolution      Conv_347                 1 1 814 980 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=204800
HardSwish        Mul_352                  1 1 980 823 0=1.666667e-01 1=5.000000e-01
Pooling          GlobalAveragePool_353    1 1 823 824 0=1 4=1
Reshape          Reshape_359              1 1 824 832 0=-1
BatchNorm        BatchNormalization_360   1 1 832 833 0=1280
HardSwish        Mul_365                  1 1 833 840 0=1.666667e-01 1=5.000000e-01
InnerProduct     Gemm_366                 1 1 840 841 0=2 1=1 2=2560
BinaryOp         Mul_368                  1 1 841 843 0=2 1=1 2=1.000000e+00
Softmax          Softmax_369              1 1 843 softmax 0=0 1=1
