7767517
134 149
Input            data                     0 1 data
Reshape          Reshape_1                1 1 data 372 0=80 1=80 2=3
Convolution      Conv_2                   1 1 372 587 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
PReLU            PRelu_3                  1 1 587 376 0=32
ConvolutionDepthWise Conv_4                   1 1 376 590 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
PReLU            PRelu_5                  1 1 590 380 0=32
Convolution      Conv_6                   1 1 380 593 0=103 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3296
PReLU            PRelu_7                  1 1 593 384 0=103
ConvolutionDepthWise Conv_8                   1 1 384 596 0=103 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=927 7=103
PReLU            PRelu_9                  1 1 596 388 0=103
Convolution      Conv_10                  1 1 388 599 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6592
Split            splitncnn_0              1 2 599 599_splitncnn_0 599_splitncnn_1
Convolution      Conv_11                  1 1 599_splitncnn_1 602 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_12                 1 1 602 394 0=13
ConvolutionDepthWise Conv_13                  1 1 394 605 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_14                 1 1 605 398 0=13
Convolution      Conv_15                  1 1 398 608 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_16                   2 1 599_splitncnn_0 608 401 0=0
Split            splitncnn_1              1 2 401 401_splitncnn_0 401_splitncnn_1
Convolution      Conv_17                  1 1 401_splitncnn_1 611 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1664
PReLU            PRelu_18                 1 1 611 405 0=26
ConvolutionDepthWise Conv_19                  1 1 405 614 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_20                 1 1 614 409 0=26
Convolution      Conv_21                  1 1 409 617 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1664
BinaryOp         Add_22                   2 1 401_splitncnn_0 617 412 0=0
Split            splitncnn_2              1 2 412 412_splitncnn_0 412_splitncnn_1
Convolution      Conv_23                  1 1 412_splitncnn_1 620 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_24                 1 1 620 416 0=13
ConvolutionDepthWise Conv_25                  1 1 416 623 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_26                 1 1 623 420 0=13
Convolution      Conv_27                  1 1 420 626 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_28                   2 1 412_splitncnn_0 626 423 0=0
Split            splitncnn_3              1 2 423 423_splitncnn_0 423_splitncnn_1
Convolution      Conv_29                  1 1 423_splitncnn_1 629 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_30                 1 1 629 427 0=52
ConvolutionDepthWise Conv_31                  1 1 427 632 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_32                 1 1 632 431 0=52
Convolution      Conv_33                  1 1 431 635 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_4              1 2 635 635_splitncnn_0 635_splitncnn_1
Pooling          GlobalAveragePool_34     1 1 635_splitncnn_1 434 0=1 4=1
Convolution      Conv_35                  1 1 434 638 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_36                  1 1 638 437
Convolution      Conv_37                  1 1 437 641 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Sigmoid          Sigmoid_38               1 1 641 440
BinaryOp         Mul_39                   2 1 635_splitncnn_0 440 441 0=2
BinaryOp         Add_40                   2 1 423_splitncnn_0 441 442 0=0
Convolution      Conv_41                  1 1 442 644 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14784
PReLU            PRelu_42                 1 1 644 446 0=231
ConvolutionDepthWise Conv_43                  1 1 446 647 0=231 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_44                 1 1 647 450 0=231
Convolution      Conv_45                  1 1 450 650 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
Split            splitncnn_5              1 2 650 650_splitncnn_0 650_splitncnn_1
Convolution      Conv_46                  1 1 650_splitncnn_1 653 0=154 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19712
PReLU            PRelu_47                 1 1 653 456 0=154
ConvolutionDepthWise Conv_48                  1 1 456 656 0=154 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1386 7=154
PReLU            PRelu_49                 1 1 656 460 0=154
Convolution      Conv_50                  1 1 460 659 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19712
BinaryOp         Add_51                   2 1 650_splitncnn_0 659 463 0=0
Split            splitncnn_6              1 2 463 463_splitncnn_0 463_splitncnn_1
Convolution      Conv_52                  1 1 463_splitncnn_1 662 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_53                 1 1 662 467 0=52
ConvolutionDepthWise Conv_54                  1 1 467 665 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_55                 1 1 665 471 0=52
Convolution      Conv_56                  1 1 471 668 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_57                   2 1 463_splitncnn_0 668 474 0=0
Split            splitncnn_7              1 2 474 474_splitncnn_0 474_splitncnn_1
Convolution      Conv_58                  1 1 474_splitncnn_1 671 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_59                 1 1 671 478 0=26
ConvolutionDepthWise Conv_60                  1 1 478 674 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_61                 1 1 674 482 0=26
Convolution      Conv_62                  1 1 482 677 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_63                   2 1 474_splitncnn_0 677 485 0=0
Split            splitncnn_8              1 2 485 485_splitncnn_0 485_splitncnn_1
Convolution      Conv_64                  1 1 485_splitncnn_1 680 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_65                 1 1 680 489 0=52
ConvolutionDepthWise Conv_66                  1 1 489 683 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_67                 1 1 683 493 0=52
Convolution      Conv_68                  1 1 493 686 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_69                   2 1 485_splitncnn_0 686 496 0=0
Split            splitncnn_9              1 2 496 496_splitncnn_0 496_splitncnn_1
Convolution      Conv_70                  1 1 496_splitncnn_1 689 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_71                 1 1 689 500 0=26
ConvolutionDepthWise Conv_72                  1 1 500 692 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_73                 1 1 692 504 0=26
Convolution      Conv_74                  1 1 504 695 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_75                   2 1 496_splitncnn_0 695 507 0=0
Split            splitncnn_10             1 2 507 507_splitncnn_0 507_splitncnn_1
Convolution      Conv_76                  1 1 507_splitncnn_1 698 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_77                 1 1 698 511 0=26
ConvolutionDepthWise Conv_78                  1 1 511 701 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_79                 1 1 701 515 0=26
Convolution      Conv_80                  1 1 515 704 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_11             1 2 704 704_splitncnn_0 704_splitncnn_1
Pooling          GlobalAveragePool_81     1 1 704_splitncnn_1 518 0=1 4=1
Convolution      Conv_82                  1 1 518 707 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_83                  1 1 707 521
Convolution      Conv_84                  1 1 521 710 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Sigmoid          Sigmoid_85               1 1 710 524
BinaryOp         Mul_86                   2 1 704_splitncnn_0 524 525 0=2
BinaryOp         Add_87                   2 1 507_splitncnn_0 525 526 0=0
Convolution      Conv_88                  1 1 526 713 0=308 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
PReLU            PRelu_89                 1 1 713 530 0=308
ConvolutionDepthWise Conv_90                  1 1 530 716 0=308 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2772 7=308
PReLU            PRelu_91                 1 1 716 534 0=308
Convolution      Conv_92                  1 1 534 719 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
Split            splitncnn_12             1 2 719 719_splitncnn_0 719_splitncnn_1
Convolution      Conv_93                  1 1 719_splitncnn_1 722 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_94                 1 1 722 540 0=26
ConvolutionDepthWise Conv_95                  1 1 540 725 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_96                 1 1 725 544 0=26
Convolution      Conv_97                  1 1 544 728 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_98                   2 1 719_splitncnn_0 728 547 0=0
Split            splitncnn_13             1 2 547 547_splitncnn_0 547_splitncnn_1
Convolution      Conv_99                  1 1 547_splitncnn_1 731 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_100                1 1 731 551 0=26
ConvolutionDepthWise Conv_101                 1 1 551 734 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_102                1 1 734 555 0=26
Convolution      Conv_103                 1 1 555 737 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_14             1 2 737 737_splitncnn_0 737_splitncnn_1
Pooling          GlobalAveragePool_104    1 1 737_splitncnn_1 558 0=1 4=1
Convolution      Conv_105                 1 1 558 740 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_106                 1 1 740 561
Convolution      Conv_107                 1 1 561 743 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Sigmoid          Sigmoid_108              1 1 743 564
BinaryOp         Mul_109                  2 1 737_splitncnn_0 564 565 0=2
BinaryOp         Add_110                  2 1 547_splitncnn_0 565 566 0=0
Convolution      Conv_111                 1 1 566 746 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_112                1 1 746 570 0=512
ConvolutionDepthWise Conv_113                 1 1 570 749 0=512 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800 7=512
Reshape          Reshape_119              1 1 749 580 0=-1
InnerProduct     MatMul_120               1 1 580 582 0=128 1=0 2=65536
BatchNorm        BatchNormalization_121   1 1 582 583 0=128
InnerProduct     MatMul_122               1 1 583 585 0=3 1=0 2=384
Softmax          Softmax_123              1 1 585 softmax 0=0 1=1
